Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Our versions follow the form ``<epoch>:<version>-<revision>`` or in BitBake variable terms ${:term:`PE`}:${:term:`PV`}-${:term:`PR`}. We generally follow the `Debian <https://www.debian.org/doc/debian-policy/ch-controlfields.html#version>`__ version policy which defines these terms.
it_it: Le nostre versioni seguono il formato ``<epoch>:<version>-<revision>`` o, in termini di variabili BitBake, ${:term:`PE`}:${:term:`PV`}-${:term:`PR`}. Generalmente seguiamo la politica sulle versioni di `Debian <https://www.debian.org/doc/debian-policy/ch-controlfields.html#version>`__ che definisce questi termini.

source: Overall Architecture
it_it: Architettura Generale

source: Overall Architecture of the Linux Tracing and Profiling Tools
it_it: Architettura Generale dei Tool di Tracing e Profilazione di Linux

source: Overview and Concepts
it_it: Panoramica e Concetti

source: Package - bundle files for installation
it_it: Package - pacchettizzazione dei file per l'installazione

source: Package Feeds
it_it: Feed dei Pacchetti

source: Package Splitting
it_it: Suddivisione in Pacchetti

source: Package feeds are an intermediary step in the build process. The OpenEmbedded build system provides classes to generate different package types, and you specify which classes to enable through the :term:`PACKAGE_CLASSES` variable. Before placing the packages into package feeds, the build process validates them with generated output quality assurance checks through the :ref:`ref-classes-insane` class.
it_it: I feed di pacchetti sono una fase intermedia del processo di build. Il sistema di build OpenEmbedded fornisce classi per generare diversi tipi di pacchetti e si specificano le classi da abilitare tramite la variabile :term:`PACKAGE_CLASSES`. Prima di inserire i pacchetti nei feed, il processo di compilazione li convalida con i controlli di qualità dell'output generati tramite la classe :ref:`ref-classes-insane`.

source: Package installation is under control of the package manager (e.g. dnf/rpm, opkg, or apt/dpkg) regardless of whether or not package management is enabled for the target. At the end of the process, if package management is not enabled for the target, the package manager's data files are deleted from the root filesystem. As part of the final stage of package installation, post installation scripts that are part of the packages are run. Any scripts that fail to run on the build host are run on the target when the target system is first booted. If you are using a :ref:`read-only root filesystem <security-manual/read-only-rootfs:creating a read-only root filesystem>`, all the post installation scripts must succeed on the build host during the package installation phase since the root filesystem on the target is read-only.
it_it: L''installazione dei pacchetti è gestita dal "package manager" (ad esempio dnf/rpm, opkg o apt/dpkg) indipendentemente dal fatto che la gestione dei pacchetti sia abilitata o meno per il sistema target. Al termine del processo, se la gestione dei pacchetti non è abilitata per il sistema target, i file di dati del gestore di pacchetti vengono eliminati dal filesystem root. Come parte della fase finale dell'installazione dei pacchetti, vengono eseguiti gli script di post-installazione inclusi nei pacchetti stessi. Gli script che non vengono eseguiti correttamente sull'host di build vengono eseguiti sul sistema target al primo avvio. Se si utilizza un filesystem root di sola lettura (vedere :ref:`filesystem a sola lettura <security-manual/read-only-rootfs:creating a read-only root filesystem>`, tutti gli script di post-installazione devono essere eseguiti correttamente sull'host di build durante la fase di installazione dei pacchetti, poiché il filesystem root sul sistema di destinazione è di sola lettura.

source: Package managers
it_it: Gestori di pacchetti

source: Package managers (RPM, DEB and IPK formats) testing in the :term:`OpenEmbedded Build System` (different from the ``package-management`` :term:`image feature <IMAGE_FEATURES>`)
it_it: Test dei gestori di pacchetti (formati RPM, DEB e IPK) in :term:`OpenEmbedded Build System` (diverso dalla funzionalità ``package-management`` :term:`image feature <IMAGE_FEATURES>`)

source: Package specific variables are typically grouped together, e.g.::
it_it: Le variabili specifiche del pacchetto sono generalmente raggruppate, ad esempio::

source: Packages for Finished Targets
it_it: Pacchetti per Piattaforme Target

source: Packages for a recipe are listed in the :term:`PACKAGES` variable. The :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>` configuration file defines the following default list of packages::
it_it: I pacchetti per una ricetta sono elencati nella variabile :term:`PACKAGES`. Il file di configurazione :oe_git:`bitbake.conf </openembedded-core/tree/meta/conf/bitbake.conf>` definisce il seguente elenco predefinito di pacchetti::

source: Part of the Yocto Project development and release process is quality assurance through the execution of test strategies. Test strategies provide the Yocto Project team a way to ensure a release is validated. Additionally, because the test strategies are visible to you as a developer, you can validate your projects. This section overviews the available test infrastructure used in the Yocto Project. For information on how to run available tests on your projects, see the ":ref:`test-manual/runtime-testing:performing automated runtime testing`" section in the Yocto Project Test Environment Manual.
it_it: Parte del processo di sviluppo e rilascio di Yocto Project è la garanzia di qualità attraverso l'esecuzione di strategie di test. Le strategie di test forniscono al team di Yocto Project un modo per garantire che una release sia valida. Inoltre, poiché le strategie di test sono visibili agli sviluppatori, è possibile validare i propri progetti. Questa sezione fornisce una panoramica dell'infrastruttura di test disponibile utilizzata in Yocto Project. Per informazioni su come eseguire i test disponibili sui propri progetti, consultare la sezione ":ref:`test-manual/runtime-testing:performing automated runtime testing`" nel Manuale dell'Ambiente di Test di Yocto Project.

source: Patch - apply patches for bug fixes and new capability
it_it: Patch - applicazione delle patch per la correzione di bug e nuove funzionalità

source: Patch Upstream Status
it_it: Stato della Patch Upstream

source: Patch format
it_it: Formato della Patch

source: Patch reviews for feature and recipe upgrade patches are likely be delayed during a feature freeze because these types of patches aren't merged during at that time --- you may have to wait until after the freeze is lifted.
it_it: Le revisioni delle patch per gli aggiornamenti di funzionalità e ricette potrebbero subire ritardi durante un blocco delle funzionalità, poiché questo tipo di patch non viene unito in quel periodo; potrebbe essere necessario attendere la revoca del blocco.

source: Patches generated or updated by ``devtool`` are created with no signature.
it_it: Le patch generate o aggiornate da ``devtool`` vengono create senza firma.

source: Patches submitted for a stable branch need to be isolated changes that are human readable and understandable. Fixes for CVEs or other issues which have a high complexity, consist of a large number of commits and/or a large numbers of changed lines are unlikely to be accepted due to the difficulty they cause with maintainability and scalability.
it_it: Le patch inviate per un branch stabile devono essere modifiche isolate, leggibili e comprensibili. Le correzioni per CVE o altri problemi di elevata complessità, che consistono in un numero elevato di commit e/o un numero elevato di righe modificate, difficilmente verranno accettate a causa delle difficoltà che comportano in termini di manutenibilità e scalabilità.

source: Patches to set :term:`UPSTREAM_STABLE_RELEASE_REGEX` are sent against the master branch first and follow the normal review process. Once accepted on master they may be backported to stable release branches. Exceptions may be made when necessary, e.g. setting :term:`UPSTREAM_STABLE_RELEASE_REGEX` on a stable branch for a recipe which has since been removed on master.
it_it: Le patch per impostare :term:`UPSTREAM_STABLE_RELEASE_REGEX` vengono inviate prima al ramo master e seguono il normale processo di revisione. Una volta accettate su master, possono essere retroportate ai rami di rilascio stabili. Possono essere fatte delle eccezioni quando necessario, ad esempio impostando :term:`UPSTREAM_STABLE_RELEASE_REGEX` su un ramo stabile per una ricetta che è stata successivamente rimossa su master.

source: Patches to upgrade recipes without this variable may still be submitted for stable branches, but the barrier for acceptance is high. The commit message needs to justify that the version upgrade follows our stable branch policy or that there is an exceptional reason for taking the upgrade.
it_it: È comunque possibile inviare patch per aggiornare ricette senza questa variabile per i branch stabili, ma la soglia di accettazione è elevata. Il messaggio di commit deve giustificare che l'aggiornamento di versione segue la nostra politica per i branch stabili o che esiste un motivo eccezionale per effettuare l'aggiornamento.

source: Patching
it_it: Applicazione delle Patch

source: Patchtest tool selftests
it_it: Auto-test del tool Patchtest

source: Paul Barker <paul [at] pbarker [dot] dev> `Public key <https://keys.openpgp.org/search?q=paul@pbarker.dev>`__
it_it: Paul Barker <paul [at] pbarker [dot] dev> `Chiave pubblica <https://keys.openpgp.org/search?q=paul@pbarker.dev>`__

source: Pay particular attention to the security for any web-based administration interface.
it_it: Prestare particolare attenzione alla sicurezza di qualsiasi interfaccia di amministrazione basata sul web.

source: Perform the following steps to install Toaster:
it_it: Eseguire i seguenti passaggi per installare Toaster:

source: Permission is granted to copy, distribute and/or modify this document under the terms of the `Creative Commons Attribution-Share Alike 2.0 UK: England & Wales <https://creativecommons.org/licenses/by-sa/2.0/uk/>`__ as published by Creative Commons.
it_it: È consentito copiare, distribuire e/o modificare questo documento secondo i termini della licenza `Creative Commons Attribution-Share Alike 2.0 UK: England & Wales <https://creativecommons.org/licenses/by-sa/2.0/uk/>`__ pubblicata da Creative Commons.

source: Place the BSP-specific files in the proper directory inside the BSP layer. How expansive the layer is affects where you must place these files. For example, if your layer supports several different machine types, you need to be sure your layer's directory structure includes hierarchy that separates the files according to machine. If your layer does not support multiple machines, the layer would not have that additional hierarchy and the files would obviously not be able to reside in a machine-specific directory.
it_it: Inserire i file specifici del BSP nella directory corretta all'interno del layer BSP. La complessità del layer influisce sulla posizione in cui è necessario collocare questi file. Ad esempio, se il layer supporta diversi tipi di macchine, è necessario assicurarsi che la struttura delle directory del layer includa una gerarchia che separi i file in base alla macchina. Se il layer non supporta più macchine, non avrà questa gerarchia aggiuntiva e i file ovviamente non potranno risiedere in una directory specifica per la macchina.

source: Poky began as an open-source project initially developed by OpenedHand. OpenedHand developed Poky from the existing OpenEmbedded build system to create a commercially supportable build system for embedded Linux. After Intel Corporation acquired OpenedHand, the poky project became the basis for the Yocto Project's build system.
it_it: Poky è nato come un progetto open-source inizialmente sviluppato da OpenedHand. OpenedHand ha sviluppato Poky a partire dal sistema di build OpenEmbedded esistente per creare un sistema di build commercialmente supportato per Linux embedded. Dopo l'acquisizione di OpenedHand da parte di Intel Corporation, il progetto Poky è diventato la base per il sistema di build di Yocto Project.

source: Poky has a regular, well established, six-month release cycle detailed in the :doc:`/ref-manual/release-process` of the Yocto Project Reference Manual.
it_it: Poky ha un ciclo di rilascio regolare e ben consolidato di sei mesi, descritto in dettaglio nel documento :doc:`/ref-manual/release-process` del Manuale di Riferimento di Yocto Project.

source: Poky is not a product level distro. Rather, it is a good starting point for customization.
it_it: Poky non è una distribuzione a livello di prodotto. Piuttosto, è un buon punto di partenza per la personalizzazione.

source: Poky, which is pronounced *Pock*-ee, is a reference embedded distribution and a reference test configuration. Poky provides the following:
it_it: Poky, che si pronuncia *Pochi*, è una distribuzione embedded di riferimento e una configurazione di test di riferimento. Poky offre quanto segue:

source: Policies on testing these layers depend on how widespread their usage is and determined on a case-by-case basis. You can find some :term:`Mixin` layers in the :yocto_git:`meta-lts-mixins </meta-lts-mixins>` repository. While the Yocto Project provides hosting for those repositories, it does not provide testing on them. Other :term:`Mixin` layers may be released elsewhere by the wider community.
it_it: Le politiche di test di questi layer dipendono dalla loro diffusione e vengono determinate caso per caso. È possibile trovare alcuni layer :term:`Mixin` nel repository :yocto_git:`meta-lts-mixins </meta-lts-mixins>`. Sebbene il Yocto Project fornisca l'hosting per questi repository, non si occupa del loro test. Altri layer :term:`Mixin` potrebbero essere rilasciati altrove dalla community.

source: Post-Installation Scripts and Read-Only Root Filesystem
it_it: Script di Post-Installazione e Filesystem Root di Sola Lettura

source: PowerPC architecture testing (32-bit)
it_it: Test dell'architettura PowerPC (32 bit)

source: PowerPC architecture testing (32-bit) with systemd
it_it: Test dell'architettura PowerPC (32 bit) con systemd

source: PowerPC architecture testing (64-bit)
it_it: Test dell'architettura PowerPC (64 bit)

source: Practically speaking, that means you need to do the following:
it_it: In pratica, ciò significa che si deve fare quanto segue:

source: Pre-Configured Releases
it_it: Release Pre-Configurate

source: Pre-built User Binaries
it_it: Binari Utente Precompilati

source: Pre-compiled images are bundled with a time-limited kernel that runs for a predetermined amount of time (10 days) before it forces the system to reboot. This limitation is meant to discourage direct redistribution of the image. You must eventually rebuild the image if you want to remove this restriction.
it_it: Le immagini precompilate includono un kernel a tempo limitato che viene eseguito per un periodo di tempo predeterminato (10 giorni) prima di forzare il riavvio del sistema. Questa limitazione ha lo scopo di scoraggiare la ridistribuzione diretta dell'immagine. Per rimuovere questa restrizione, è necessario ricompilare l'immagine.

source: Prepare the ``runbuilds-service.sh`` script that you need to place in the ``/var/www/toaster/poky/bitbake/lib/toaster/`` directory by setting up executable permissions::
it_it: Preparare lo script ``runbuilds-service.sh`` da posizionare nella directory ``/var/www/toaster/poky/bitbake/lib/toaster/`` impostando i permessi di esecuzione::

source: Prepare the systemd service to run Toaster builds. Here is a sample configuration file for the service:
it_it: Preparare il servizio systemd per eseguire le build di Toaster. Ecco un esempio di file di configurazione per il servizio:

source: Preparing Changes for Submission
it_it: Preparazione delle Modifiche per l'Invio

source: Preparing Your Build Host to Work With BSP Layers
it_it: Preparazione dell'Host di Build per Lavorare con i Layer BSP

source: Preparing the Build Host to Work on the Kernel
it_it: Preparazione dell'Host di Build per Lavorare sul Kernel.

source: Preparing to Use Toaster
it_it: Preparazione all'Uso di Toaster

source: Press Enter to leave it to the default value shown in the brackets, or type a custom directory name.
it_it: Premere Invio per lasciare il valore di default mostrato tra parentesi, oppure digitare un nome di directory personalizzato.

source: Press ``Ctrl-C`` in the blktrace shell to stop the trace. It will display how many events were logged, along with the per-cpu file sizes (blktrace records traces in per-cpu kernel buffers and just dumps them to user space for blkparse to merge and sort later)::
it_it: Premere ``Ctrl-C`` nella shell di blktrace per interrompere la traccia. Verrà visualizzato il numero di eventi registrati, insieme alle dimensioni dei file per ciascuna CPU (blktrace registra le tracce nei buffer del kernel di ogni CPU e le salva nello spazio utente affinché blkparse le unisca e le ordini in seguito)::

source: Previous versions of the OpenEmbedded build system used to create a global shared sysroot per machine along with a native sysroot. Since the 2.3 version of the Yocto Project, there are sysroots in recipe-specific :term:`WORKDIR` directories. Thus, the ``build/tmp/sysroots/`` directory is unused.
it_it: Nelle versioni precedenti del sistema di build OpenEmbedded, veniva creata una directory sysroot globale condivisa per ogni macchina, insieme a una directory sysroot nativa. Dalla versione 2.3 di Yocto Project, le directory sysroot si trovano in directory :term:`WORKDIR` specifiche per ogni ricetta. Pertanto, la directory ``build/tmp/sysroots/`` non viene più utilizzata.

source: Primary Supported
it_it: Supporto Primario

source: Prior to running the ``builddelete`` command, you need to get the ID associated with builds by using the :ref:`toaster-manual/reference:``buildslist``` command.
it_it: Prima di eseguire il comando ``builddelete``, è necessario ottenere l'ID associato alle build utilizzando il comando :ref:`toaster-manual/reference:``buildslist```.

source: Procedures for security features implemented outside of :term:`OpenEmbedded-Core (OE-Core)`.
it_it: Procedure per funzionalità di sicurezza implementate al di fuori di :term:`OpenEmbedded-Core (OE-Core)`.

source: Procedures related to processes outside of the target images; for example, how to deal with vulnerabilities.
it_it: Procedure relative a processi esterni alle immagini target; ad esempio, come gestire le vulnerabilità.

source: Procedures that help you secure an image using features supported by the Yocto Project; for example, making a root filesystem read-only.
it_it: Procedure che consentono di proteggere un'immagine utilizzando le funzionalità supportate da Yocto Project; ad esempio, rendere un filesystem root di sola lettura [read-only].

source: Production Tools
it_it: Strumenti di Produzione

source: Profile and Tracing Manual
it_it: Manuale di Profilazione e Tracing

source: Profiling is a great tool for solving many problems or for getting a high-level view of what's going on with a workload or across the system. It is however by definition an approximation, as suggested by the most prominent word associated with it, ``sampling``. On the one hand, it allows a representative picture of what's going on in the system to be cheaply taken, but alternatively, that cheapness limits its utility when that data suggests a need to "dive down" more deeply to discover what's really going on. In such cases, the only way to see what's really going on is to be able to look at (or summarize more intelligently) the individual steps that go into the higher-level behavior exposed by the coarse-grained profiling data.
it_it: La profilazione è un ottimo strumento per risolvere molti problemi o per ottenere una visione d'insieme di ciò che accade a un carico di lavoro o all'interno del sistema. Tuttavia, per definizione, si tratta di un'approssimazione, come suggerisce il termine più importante ad essa associato: ``sampling`` [campionamento]. Da un lato, consente di ottenere un'immagine rappresentativa di ciò che accade nel sistema in modo economico, ma dall'altro, questa economicità ne limita l'utilità quando i dati suggeriscono la necessità di un'analisi più approfondita per scoprire cosa sta realmente accadendo. In questi casi, l'unico modo per capire cosa sta realmente succedendo è analizzare (o riassumere in modo più intelligente) i singoli passaggi che contribuiscono al comportamento di livello superiore rivelato dai dati di profilazione a grana grossa.

source: Provide a brief "Summary" of the bug. Try to limit your summary to just a line or two and be sure to capture the essence of the bug.
it_it: Fornire un breve "Summary" [riepilogo] del bug. Cercare di limitarlo a una o due righe e assicurado di cogliere l'essenza del bug.

source: Provide a detailed "Description" of the bug. You should provide as much detail as you can about the context, behavior, output, and so forth that surrounds the bug. You can even attach supporting files for output from logs by using the "Add an attachment" button.
it_it: Fornire una "Description" dettagliata del bug. Si deve fornire il maggior numero possibile di dettagli sul contesto, il comportamento, l'output e così via relativi al bug. Si possono anche allegare file di supporto, come ad esempio i log, utilizzando il pulsante "Add an attachment".

source: Provide a single-line summary of the change and, if more explanation is needed, provide more detail in the description of the commit. This summary is typically viewable in the "shortlist" of changes. Thus, providing something short and descriptive that gives the reader a summary of the change is useful when viewing a list of many commits. You should prefix this short description with the recipe name (if changing a recipe), or else with the short form path to the file being changed.
it_it: Fornire un breve riepilogo della modifica su una sola riga e, se sono necessarie ulteriori spiegazioni, aggiungere maggiori dettagli nella descrizione del commit. Questo riepilogo è generalmente visibile nella "shortlist" delle modifiche. Pertanto, fornire una descrizione breve e concisa che riassuma la modifica è utile quando si visualizza un elenco di molti commit. Anteporre a questa breve descrizione il nome della ricetta (se si modifica una ricetta) o il path abbreviato del file modificato.

source: Put the append file in a directory whose name matches the machine's name and is located in an appropriate sub-directory inside the BSP layer (i.e. ``recipes-bsp``, ``recipes-graphics``, ``recipes-core``, and so forth).
it_it: Inserire il file di append in una directory il cui nome corrisponda al nome della macchina e che si trovi in ​​una sottodirectory appropriata all'interno del layer BSP (ad esempio, ``recipes-bsp``, ``recipes-graphics``, ``recipes-core`` e così via).

source: Python 3.9.0 or greater
it_it: Python 3.9.0 o superiore

source: Python Function formatting
it_it: Formattazione delle Funzioni Python

source: Quick Build
it_it: Build Rapida

source: README File
it_it: File README

source: README.sources File
it_it: File README.sources

source: RISC-V architecture testing (32-bit)
it_it: Test dell'architettura RISC-V (32 bit)

source: RISC-V architecture testing (64-bit)
it_it: Test dell'architettura RISC-V (64-bit)
